Confirmed that the default value on the field is the reason for create failure. Opening an internal service ticket to correct the schema.

```
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/awscc in /Users/manuchn/.local/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may
│ cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_ivs_stage.example will be created
  + resource "awscc_ivs_stage" "example" {
      + active_session_id                        = (known after apply)
      + arn                                      = (known after apply)
      + auto_participant_recording_configuration = (known after apply)
      + id                                       = (known after apply)
      + name                                     = "example-ivs-stage"
      + tags                                     = [
          + {
              + key   = "Environment"
              + value = "Testing"
            },
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_ivs_stage.example: Creating...
awscc_ivs_stage.example: Creation complete after 6s [id=arn:aws:ivs:us-east-1:############:stage/svraijoYTk6n]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```